---
type: IntegerParameterValue
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# IntegerParameterValue

`Autodesk.Revit.DB.IntegerParameterValue` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | IntegerParameterValue | — | `` |
| Constructor | IntegerParameterValue | 2016 Subscription Update | `public IntegerParameterValue ()` |
| Property | Value | 2016 Subscription Update | `public int Value { get ; set ; }` |